# Задача 1: Сортировка вставками

## Описание

В данной задаче реализуется алгоритм сортировки вставками. Алгоритм работает путём прохода по элементам массива и вставки каждого элемента в его правильную позицию среди уже отсортированных элементов.

### Формат входных данных
- Входные данные находятся в файле `input.txt`.
- Первая строка содержит одно число `n` (1 ≤ n ≤ 1000) — количество элементов в массиве.
- Вторая строка содержит `n` целых чисел, по модулю не превосходящих 10^9.

### Формат выходных данных
- В выходном файле `output.txt` должен содержаться отсортированный массив. Все числа должны быть разделены ровно одним пробелом.

### Ограничения
- Время выполнения: 2 секунды.
- Память: 256 МБ.

## Структура проекта

```
Task-1/
|-- src/
|   |-- input.txt         # Входные данные
|   |-- insertion_sort.py # Реализация алгоритма сортировки вставками
|   |-- output.txt        # Выходные данные
|-- tests/
|   |-- test_insertion_sort.py  # Тесты для проверки корректности работы алгоритма
```

## Код задачи

```python
def insertion_sort(arr):
    """
    Функция для сортировки массива методом вставки.

    Алгоритм сортирует элементы, перенося каждый новый элемент в отсортированную часть массива.

    :param arr: Список целых чисел для сортировки.
    :return: Отсортированный по возрастанию список.
    """
    for i in range(1, len(arr)):
        key = arr[i]
        j = i - 1
        # Перемещаем элементы, которые больше key, на одну позицию вперед
        while j >= 0 and key < arr[j]:
            arr[j + 1] = arr[j]
            j -= 1
        arr[j + 1] = key
    return arr

if __name__ == '__main__':
    with open('input.txt') as f:
        n, massive = f.readlines()
    array = insertion_sort(list(map(int, massive.split())))
    with open('output.txt', 'w') as f:
        print(' '.join(list(map(str, array))), file=f)
```

## Запуск проекта

1. Перейдите в директорию `src`.
2. Убедитесь, что файл `input.txt` содержит корректные входные данные в указанном формате.
3. Запустите скрипт:
   ```sh
   python insertion_sort.py
   ```
4. Результат выполнения будет записан в файл `output.txt`.

## Тестирование

Для проверки корректности работы программы выполните тесты, находящиеся в директории `tests`.

1. Перейдите в директорию `tests`.
2. Выполните команду:
   ```sh
   python -m unittest test_insertion_sort.py
   ```

### Тесты

```python
import unittest
import sys
import os
sys.path.insert(0, os.path.abspath(os.path.join(os.path.dirname(__file__), '../src')))
from insertion_sort import insertion_sort

class TestInsertionSort(unittest.TestCase):
    """
    Тесты для функции сортировки вставками.
    """

    def test_insertion_sort(self):
        """
        Проверка корректности работы сортировки вставками.
        """
        self.assertEqual(insertion_sort([31, 41, 59, 26, 41, 58]), [26, 31, 41, 41, 58, 59])

if __name__ == '__main__':
    unittest.main()
```

## Пример

### Входные данные (input.txt)
```
6
31 41 59 26 41 58
```

### Выходные данные (output.txt)
```
26 31 41 41 58 59
```
