# Задача 5: Сортировка выбором

## Описание

В данной задаче реализуется алгоритм сортировки выбором. Алгоритм последовательно находит минимальный элемент в неотсортированной части массива и ставит его на нужное место, тем самым упорядочивая элементы по возрастанию.

### Формат входных данных
- Входные данные находятся в файле `input.txt`.
- Первая строка содержит одно число `n` (1 ≤ n ≤ 1000) — количество элементов в массиве.
- Вторая строка содержит `n` целых чисел, по модулю не превосходящих 10^9.

### Формат выходных данных
- В выходном файле `output.txt` должен содержаться отсортированный массив. Все числа должны быть разделены ровно одним пробелом.

### Ограничения
- Время выполнения: 2 секунды.
- Память: 256 МБ.

## Структура проекта

```
Task-5/
|-- src/
|   |-- input.txt             # Входные данные
|   |-- selection_sort.py     # Реализация алгоритма сортировки выбором
|   |-- output.txt            # Выходные данные
|-- tests/
|   |-- test_selection_sort.py # Тесты для проверки корректности работы алгоритма
```

## Код задачи

```python
def selection_sort(arr):
    """
    Функция сортировки выбором.

    Алгоритм последовательно находит минимальный элемент и ставит его на нужное место.

    :param arr: Список целых чисел для сортировки.
    :return: Отсортированный по возрастанию список.
    """
    for i in range(len(arr)):
        min_idx = i
        # Поиск минимального элемента в оставшейся части массива
        for j in range(i + 1, len(arr)):
            if arr[j] < arr[min_idx]:
                min_idx = j
        # Меняем местами минимальный элемент и текущий элемент
        arr[i], arr[min_idx] = arr[min_idx], arr[i]
    return arr

if __name__ == '__main__':
    with open('input.txt') as f:
        n, massive = f.readlines()
    array = selection_sort(list(map(int, massive.split())))
    with open('output.txt', 'w') as f:
        print(' '.join(list(map(str, array))), file=f)
```

## Запуск проекта

1. Перейдите в директорию `src`.
2. Убедитесь, что файл `input.txt` содержит корректные входные данные в указанном формате.
3. Запустите скрипт:
   ```sh
   python selection_sort.py
   ```
4. Результат выполнения будет записан в файл `output.txt`.

## Тестирование

Для проверки корректности работы программы выполните тесты, находящиеся в директории `tests`.

1. Перейдите в директорию `tests`.
2. Выполните команду:
   ```sh
   python -m unittest test_selection_sort.py
   ```

### Тесты

```python
import unittest
import sys
import os
sys.path.insert(0, os.path.abspath(os.path.join(os.path.dirname(__file__), '../src')))
from selection_sort import selection_sort

class TestSelectionSort(unittest.TestCase):
    """
    Тесты для функции сортировки выбором.
    """

    def test_selection_sort(self):
        """
        Проверка корректности работы сортировки выбором.
        """
        self.assertEqual(selection_sort([31, 41, 59, 26, 41, 58]), [26, 31, 41, 41, 58, 59])

if __name__ == '__main__':
    unittest.main()
```

## Пример

### Входные данные (input.txt)
```
6
31 41 59 26 41 58
```

### Выходные данные (output.txt)
```
26 31 41 41 58 59
```
