# Задача 6: Пузырьковая сортировка

## Описание

В данной задаче реализуется алгоритм пузырьковой сортировки. Алгоритм многократно сравнивает соседние элементы и меняет их местами, если они не упорядочены, тем самым упорядочивая элементы по возрастанию.

### Формат входных данных
- Входные данные находятся в файле `input.txt`.
- Первая строка содержит одно число `n` (1 ≤ n ≤ 1000) — количество элементов в массиве.
- Вторая строка содержит `n` целых чисел, по модулю не превосходящих 10^9.

### Формат выходных данных
- В выходном файле `output.txt` должен содержаться отсортированный массив. Все числа должны быть разделены ровно одним пробелом.

### Ограничения
- Время выполнения: 2 секунды.
- Память: 256 МБ.

## Структура проекта

```
Task-6/
|-- src/
|   |-- input.txt             # Входные данные
|   |-- bubble_sort.py        # Реализация алгоритма пузырьковой сортировки
|   |-- output.txt            # Выходные данные
|-- tests/
|   |-- test_bubble_sort.py   # Тесты для проверки корректности работы алгоритма
```

## Код задачи

```python
def bubble_sort(arr):
    """
    Функция пузырьковой сортировки.

    Алгоритм многократно сравнивает соседние элементы и меняет их местами, если они не упорядочены.

    :param arr: Список целых чисел для сортировки.
    :return: Отсортированный по возрастанию список.
    """
    n = len(arr)
    for i in range(n):
        # Последние i элементов уже отсортированы
        for j in range(0, n - i - 1):
            if arr[j] > arr[j + 1]:
                # Меняем местами элементы
                arr[j], arr[j + 1] = arr[j + 1], arr[j]
    return arr

if __name__ == '__main__':
    with open('input.txt') as f:
        n, massive = f.readlines()
    array = bubble_sort(list(map(int, massive.split())))
    with open('output.txt', 'w') as f:
        print(' '.join(list(map(str, array))), file=f)
```

## Запуск проекта

1. Перейдите в директорию `src`.
2. Убедитесь, что файл `input.txt` содержит корректные входные данные в указанном формате.
3. Запустите скрипт:
   ```sh
   python bubble_sort.py
   ```
4. Результат выполнения будет записан в файл `output.txt`.

## Тестирование

Для проверки корректности работы программы выполните тесты, находящиеся в директории `tests`.

1. Перейдите в директорию `tests`.
2. Выполните команду:
   ```sh
   python -m unittest test_bubble_sort.py
   ```

### Тесты

```python
import unittest
import sys
import os
sys.path.insert(0, os.path.abspath(os.path.join(os.path.dirname(__file__), '../src')))
from bubble_sort import bubble_sort

class TestBubbleSort(unittest.TestCase):
    """
    Тесты для пузырьковой сортировки.
    """

    def test_bubble_sort(self):
        """
        Проверка корректности работы пузырьковой сортировки.
        """
        self.assertEqual(bubble_sort([31, 41, 59, 26, 41, 58]), [26, 31, 41, 41, 58, 59])

if __name__ == '__main__':
    unittest.main()
```

## Пример

### Входные данные (input.txt)
```
6
31 41 59 26 41 58
```

### Выходные данные (output.txt)
```
26 31 41 41 58 59
```
